; domain
(define (domain os_sequencedstrips_p5_1-domain)
 (:requirements :strips :typing :action-costs)
 (:types order product count)
 (:constants
   p3 p5 p2 p1 p4 - product
   o5 o1 o2 o4 o3 - order
 )
 (:predicates (includes ?o - order ?p - product) (waiting ?o - order) (started ?o - order) (shipped ?o - order) (made ?p - product) (not_made ?p - product) (stacks_avail ?s - count) (next_count ?s - count ?ns - count))
 (:functions (total-cost))
 (:action open_new_stack
  :parameters ( ?open - count ?new_open - count)
  :precondition (and (stacks_avail ?open) (next_count ?open ?new_open))
  :effect (and (not (stacks_avail ?open)) (stacks_avail ?new_open) (increase (total-cost) 1)))
 (:action start_order
  :parameters ( ?o - order ?avail - count ?new_avail - count)
  :precondition (and (waiting ?o) (stacks_avail ?avail) (next_count ?new_avail ?avail))
  :effect (and (not (waiting ?o)) (started ?o) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
 (:action make_product_p1
  :parameters ()
  :precondition (and (not_made p1) (started o2))
  :effect (and (not (not_made p1)) (made p1) (increase (total-cost) 0)))
 (:action make_product_p2
  :parameters ()
  :precondition (and (not_made p2) (started o1) (started o2))
  :effect (and (not (not_made p2)) (made p2) (increase (total-cost) 0)))
 (:action make_product_p3
  :parameters ()
  :precondition (and (not_made p3) (started o3) (started o4))
  :effect (and (not (not_made p3)) (made p3) (increase (total-cost) 0)))
 (:action make_product_p4
  :parameters ()
  :precondition (and (not_made p4) (started o4))
  :effect (and (not (not_made p4)) (made p4) (increase (total-cost) 0)))
 (:action make_product_p5
  :parameters ()
  :precondition (and (not_made p5) (started o5))
  :effect (and (not (not_made p5)) (made p5) (increase (total-cost) 0)))
 (:action ship_order_o1
  :parameters ( ?avail - count ?new_avail - count)
  :precondition (and (started o1) (made p2) (stacks_avail ?avail) (next_count ?avail ?new_avail))
  :effect (and (not (started o1)) (shipped o1) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
 (:action ship_order_o2
  :parameters ( ?avail - count ?new_avail - count)
  :precondition (and (started o2) (made p1) (made p2) (stacks_avail ?avail) (next_count ?avail ?new_avail))
  :effect (and (not (started o2)) (shipped o2) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
 (:action ship_order_o3
  :parameters ( ?avail - count ?new_avail - count)
  :precondition (and (started o3) (made p3) (stacks_avail ?avail) (next_count ?avail ?new_avail))
  :effect (and (not (started o3)) (shipped o3) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
 (:action ship_order_o4
  :parameters ( ?avail - count ?new_avail - count)
  :precondition (and (started o4) (made p3) (made p4) (stacks_avail ?avail) (next_count ?avail ?new_avail))
  :effect (and (not (started o4)) (shipped o4) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
 (:action ship_order_o5
  :parameters ( ?avail - count ?new_avail - count)
  :precondition (and (started o5) (made p5) (stacks_avail ?avail) (next_count ?avail ?new_avail))
  :effect (and (not (started o5)) (shipped o5) (not (stacks_avail ?avail)) (stacks_avail ?new_avail) (increase (total-cost) 0)))
)

; problem
(define (problem os_sequencedstrips_p5_1-problem)
 (:domain os_sequencedstrips_p5_1-domain)
 (:objects
   n0 n1 n2 n3 n4 n5 - count
 )
 (:init (next_count n0 n1) (next_count n1 n2) (next_count n2 n3) (next_count n3 n4) (next_count n4 n5) (stacks_avail n0) (waiting o1) (includes o1 p2) (waiting o2) (includes o2 p1) (includes o2 p2) (waiting o3) (includes o3 p3) (waiting o4) (includes o4 p3) (includes o4 p4) (waiting o5) (includes o5 p5) (not_made p1) (not_made p2) (not_made p3) (not_made p4) (not_made p5) (= (total-cost) 0))
 (:goal (and (shipped o1) (shipped o2) (shipped o3) (shipped o4) (shipped o5)))
 (:metric minimize (total-cost))
)

; plan
1. (open_new_stack n0 n1)
   deleted: (stacks_avail n0)
   added: (stacks_avail n1)
   goals met: 0 of 5
2. (start_order o1 n1 n0)
   deleted: (waiting o1) (stacks_avail n1)
   added: (started o1) (stacks_avail n0)
   goals met: 0 of 5
3. (open_new_stack n0 n1)
   deleted: (stacks_avail n0)
   added: (stacks_avail n1)
   goals met: 0 of 5
4. (start_order o3 n1 n0)
   deleted: (waiting o3) (stacks_avail n1)
   added: (started o3) (stacks_avail n0)
   goals met: 0 of 5
5. (open_new_stack n0 n1)
   deleted: (stacks_avail n0)
   added: (stacks_avail n1)
   goals met: 0 of 5
6. (start_order o5 n1 n0)
   deleted: (waiting o5) (stacks_avail n1)
   added: (started o5) (stacks_avail n0)
   goals met: 0 of 5
7. (make_product_p5)
   deleted: (not_made p5)
   added: (made p5)
   goals met: 0 of 5
8. (ship_order_o5 n0 n1)
   deleted: (started o5) (stacks_avail n0)
   added: (shipped o5) (stacks_avail n1)
   goals met: 1 of 5
9. (start_order o2 n1 n0)
   deleted: (waiting o2) (stacks_avail n1)
   added: (started o2) (stacks_avail n0)
   goals met: 1 of 5
10. (make_product_p1)
   deleted: (not_made p1)
   added: (made p1)
   goals met: 1 of 5
11. (make_product_p2)
   deleted: (not_made p2)
   added: (made p2)
   goals met: 1 of 5
12. (ship_order_o2 n0 n1)
   deleted: (started o2) (stacks_avail n0)
   added: (shipped o2) (stacks_avail n1)
   goals met: 2 of 5
13. (ship_order_o1 n1 n2)
   deleted: (started o1) (stacks_avail n1)
   added: (shipped o1) (stacks_avail n2)
   goals met: 3 of 5
14. (start_order o4 n2 n1)
   deleted: (waiting o4) (stacks_avail n2)
   added: (started o4) (stacks_avail n1)
   goals met: 3 of 5
15. (make_product_p4)
   deleted: (not_made p4)
   added: (made p4)
   goals met: 3 of 5
16. (make_product_p3)
   deleted: (not_made p3)
   added: (made p3)
   goals met: 3 of 5
17. (ship_order_o4 n1 n2)
   deleted: (started o4) (stacks_avail n1)
   added: (shipped o4) (stacks_avail n2)
   goals met: 4 of 5
18. (ship_order_o3 n2 n3)
   deleted: (started o3) (stacks_avail n2)
   added: (shipped o3) (stacks_avail n3)
   goals met: 5 of 5
